import { Language } from '../../../../src/iviche/common/Language'

type WordsDict = {
  [lang in Language]: Array<string>
}

export const words: WordsDict = {
  RU: `В случае проведения успешных реформ в Украине Евросоюз будет согласен пересмотреть
  отношения с Киевом в частности обсудить перспективу членства Об этом рассказал сопредседатель
  Парламентского комитета ассоциации Украина-ЕС евродепутат от Польши Витольд Ващиковский в интервью
  Европейской правде в среду 13ноября Ващиковский напомнил что сейчас Украина активно продвигает
  инициативу дифференциации формата Восточного партнерства с выделением стран которые подписали 
  соглашение об ассоциации и у которых есть стремление обрести членство в ЕС Однако по его словам
  пока Евросоюз не способен создать единый подход к украинскому и многим другим вопросам К сожалению
  ситуация сейчас неблагоприятная. Мы видим, что Германия, которая была локомотивом внешней политики
  ЕС фактически самоустранилась Макрон пытается найти такой выход из кризиса в собственном
  государстве который часто противоречит интересам ЕС В Италии свои проблемы Испания занята
  каталонской проблемой и так далее отметил Ващиковский Отвечая на вопрос когда ЕС может вернуться
  к конструктиву в рассмотрении инициативы об отдельном формате Ващиковский ответил что это будет
  зависеть от Украины Президент Зеленский дал очень много обещаний перед выборами Есть новое
  правительство Верховная рада взяла турбоскорость для принятия обещанных законов У украинцев при
  этом большие ожидания люди ждут что их жизнь вскоре улучшится И обычно уже через год люди начинают
  стучаться к власти и спрашивать где выполнение таких обещаний отметил он Поэтому Евросоюз хотел бы
  подождать этот год и посмотреть что сделано и как изменилась поддержка украинского президента
  подытожил Ващиковский`
    .replace(/\n/g, '')
    .split(' ')
    .filter(word => word.length > 0),
  UA: `У разі проведення успішних реформ в Україні Євросоюз буде згоден переглянути відносини з
  Києвом, зокрема обговорити перспективу членства України у союзі Про це розповів співголова
  Парламентського комітету асоціації Україна-ЄС євродепутат від Польщі Вітольд Ващиковський в
  інтерв'ю Європейській правді в середу 13листопада Ващиковський нагадав що зараз Україна активно
  просуває ініціативу диференціації формату Східного партнерства з виділенням країн які підписали
  угоду про асоціацію і у яких є прагнення набути членство в ЄС Однак за його словами поки Євросоюз
  не здатний створити єдиний підхід до українського і багатьох інших питань На жаль ситуація зараз
  несприятлива Ми бачимо що Німеччина яка була локомотивом зовнішньої політики ЄС фактично
  самоусунулася Макрон намагається знайти такий вихід з кризи у власній державі який часто
  суперечить інтересам ЄС В Італії свої проблеми Іспанія зайнята каталонською проблемою і так далі
  зазначив Ващиковський Відповідаючи на питання коли ЄС може повернутися до конструктиву в розгляді
  ініціативи про окремий формат Ващиковський відповів що це буде залежати від України Президент
  Зеленський дав дуже багато обіцянок перед виборами Є новий уряд Верховна рада взяла турбошвидкість
  для прийняття обіцяних законів В українців при цьому великі очікування люди чекають що їхнє життя
  незабаром покращиться І звичайно вже через рік люди починають стукати до влади і питати де
  виконання таких обіцянок зазначив він Тому Євросоюз хотів би почекати цей рік і подивитися що
  зроблено і як змінилася підтримка українського президента підсумував Ващиковський`
    .replace(/\n/g, '')
    .split(' ')
    .filter(word => word.length > 0),
  EN: 'not supported'.split(' '),
}

export const generateBodyText = (lang: Language, objectNumber: number): string => {
  const result = new Array<string>()
  const articleSize = 9 + (objectNumber % 10) * 128
  const dictSize = words[lang].length
  const start = (Math.floor(objectNumber / 10) * 133) % dictSize

  let pointer = start
  for (let i = 0; i <= articleSize; i += 1) {
    if (pointer >= dictSize) {
      pointer = 0
      result.push('\n\n')
    }

    result.push(words[lang][pointer])

    pointer += 1
  }

  return result.join(' ')
}
