import { ArticleTitleDefinition } from '../ArticleTitleDefinition'

export const globalLastnameThemes: Array<ArticleTitleDefinition> = [
  {
    RU: 'Кто станет следующим Президентом Украины',
    UA: 'Хто стане наступним Президентом України',
  },
  {
    RU: 'Кто станет следующим премьер-министром',
    UA: "Хто стане наступним прем'єр-міністром",
  },
  {
    RU: 'Кто станет следующим Председателем Верховной рады Украины',
    UA: 'Хто стане наступним Головою Верховної Ради України',
  },
  {
    RU: 'Кто станет следующим руководителем Национального Банка Украины',
    UA: 'Хто стане наступним керівником Національного Банку України',
  },
  {
    RU: 'Кто станет следующим руководителем Совета Национальной Безопасности и Обороны Украины',
    UA: 'Хто стане наступним керівником Ради Національної Безпеки та Оборони України',
  },
  {
    RU: 'Кто станет следующим руководителем Служби Безопасности Украины',
    UA: 'Хто стане наступним керівником Служби Безпеки України',
  },
]

export const pollRelatedThemes = [
  {
    RU: 'Должна ли Украина присоединиться к ЕС',
    UA: 'Чи має Україна вступити до ЄС',
  },
  {
    RU: 'Должна ли Украина присоединиться к ЕврАзЭС',
    UA: 'Чи має Україна приєднатися до ЄврАзЕС',
  },
  {
    RU: 'Должна ли Украина присоединиться к НАТО',
    UA: 'Чи має Україна приєднатися до НАТО',
  },
  {
    RU: 'Должна ли Украина присоединиться к СНГ',
    UA: 'Чи має Україна приєднатися до СНД',
  },
  {
    RU: 'Должна ли Украина присоединиться к Восточно Европейскому Союзу',
    UA: 'Чи має Україна приєднатися до Східно Європейського Союзу',
  },
  {
    RU: 'Должна ли Украина присоединиться к Союзу Стран Витебского Пояса',
    UA: 'Чи має Україна приєднатися до Союзу Країн Вітебського Поясу',
  },
  {
    RU: 'Должна ли Украина присоединиться к строительству Нового Шелкового Пути',
    UA: 'Чи має Україна приєднатися до будівництва Нового Шовкового Шляху',
  },
  {
    RU: 'Должна ли Украина присоединиться к строительству Международной Космической Станции',
    UA: 'Чи має Україна приєднатися до будівництва Міжнародної Космічної Станції',
  },
]
